[
  {
    "title": "Coordinator of Virtual Campus & Online Services",
    "org": "Adelphi University",
    "link": "https://www.adelphi.edu",
    "dept": "Learning and Writing Centers",
    "deptlink": "https://learning.adelphi.edu",
    "start": 2018,
    "end": -1,
    "desc": [
      "Serve as the primary point of contact for the development and management of the Learning and Writing Centers' interactive Virtual Campus, hosted on the Moodle LMS platform.",

      "Conceptualize and execute the production of digital multimedia educational resources for student use (including interactive web-based educational tools, video tutorials, live broadcasts of Learning and Writing Center academic workshops, etc.) to aid students in developing holistic academic skills.",

      "Adeptly employ instructional design; critical thinking and creative problem solving; data-driven analytical frameworks; and technical expertise to build more efficient and effective inward- and outward-facing service-delivery models."
    ]
  },
  {
    "title": "Freelance Musician",
    "org": "Live and Studio Performer, Writer and Composer, Transcriber, Instructor",
    "link": "https://www.brandonmdove.com",
    "start": 2010,
    "end": -1,
    "desc": [
        "Perform live as a multi-instrumentalist (primarily guitar, violin, and bass) independently; as backing support for a variety of organizations, groups, artists, and songwriters, including Grammy-winning HBO Def Poet artist J. Ivy; and as an orchestra musician for live musical productions hosted by esteemed companies including Long Island’s Gateway Playhouse.",

        "Work as a studio writer and session player for recording studios, such as Cove City Sound Studios in Glen Cove, NY; as well as for private clients throughout the New York area, including commercial-writing work for NBC/Universal.",

        "Serve as a freelance music transcriber and arranger for an array of independent clients, including keyboardist Jordan Rudess (Dream Theater, The Dixie Dregs).",
        
        "Provide private musical instruction on multiple instruments (guitar, violin, and bass), independently and through Long Island music schools, to a multitude of students with varied needs (from children to adults, from co-curricular hobby to collegiate study)."
      ]
  },
  {
    "title": "Manhattan Center Coordinator",
    "org": "Adelphi University",
    "link": "https://www.adelphi.edu",
    "dept": "Learning and Writing Centers",
    "deptlink": "https://learning.adelphi.edu",
    "start": 2014,
    "end": 2017,
    "desc": [
      "Served as the primary point of contact for all Learning and Writing Center tutoring at Adelphi University’s Manhattan Center.",

      "Oversaw the hiring, training, supervision, and evaluation of undergraduate and graduate student tutors.",

      "Worked with administrators of academic programs in Manhattan on site-specific programming.",

      "Developed and delivered workshops and other group-format service presentations for the Manhattan Center.",

      "Managed the Center’s online tutoring platform and video-distance workshop streams."
    ]
  },
  {
    "title": "Student Tutor",
    "org": "Adelphi University",
    "link": "https://www.adelphi.edu",
    "dept": "Learning and Writing Centers",
    "deptlink": "https://learning.adelphi.edu",
    "start": 2012,
    "end": 2014,
    "desc": [
      "Served as a peer tutor for college courses pertinent to the academic-specific areas of music theory, aural skills and musicianship, and musical form and analysis.", 

      "Additionally, provided one-on-one and group-format tutoring for college courses in the humanities and liberal arts, with emphasis on critical thinking, comprehension, reading, writing, study skills, and time management.",
      
      "Carried out departmental goals of delivering a holistic tutoring experience, honed through training and peer reflection, to fit diverse needs and learning styles (incl. students with special academic needs, disabilities, and ESL students).",

      "Interacted with staff training through a number of mediums (an annual full-staff training program; periodic full-staff and Center-specific meetings and reflections; and diverse digital assignments and materials as part of an ongoing tutor training portfolio)."

    ]
  }
]